<?php

return [
    'first_name' => [
        'required' => 'حقل الاسم الأول مطلوب.',
        'min' => 'الاسم الأول يجب أن يكون على الأقل :min حروف.',
        'regex' => 'الاسم الأول يحتوي على صيغة غير صالحة.',
    ],
    'last_name' => [
        'required' => 'حقل اسم العائلة مطلوب.',
        'min' => 'اسم العائلة يجب أن يكون على الأقل :min حروف.',
        'regex' => 'اسم العائلة يحتوي على صيغة غير صالحة.',
    ],
    'email' => [
        'required' => 'حقل البريد الإلكتروني مطلوب.',
        'email' => 'البريد الإلكتروني غير صالح.',
        'unique' => 'البريد الإلكتروني موجد بالفعل.',
    ],
    'phone' => [
        'required' => 'حقل رقم الهاتف مطلوب.',
        'numeric' => 'رقم الهاتف يجب أن يكون رقماً.',
    ],
    'password' => [
        'required' => 'حقل كلمة المرور مطلوب.',
        'confirmed' => 'تأكيد كلمة المرور غير مطابق.',
        'password' => 'كلمة المرور غير قوية.',
        'min' => 'كلمة على الاقل يجب ان تكون :min حروف.',
    ],
    'password_confirmation' => [
        'required' => 'حقل تأكيد كلمة المرور مطلوب.',
    ],

];